In [ ]:
# TODO
# Set up spark session ✔
# Import single-line JSON files ✔
    # Optimize ==> Create a Function to Import all of these files and assign names ot them; perhaps using wrappers?

# Data validation
    # Check if any null values ✔
    # Customer according to specs:

## Required Imports
---

In [1]:
import pandas as pd
import pyspark 
import pyspark.pandas as ps
from pyspark.sql.functions import udf
from pyspark.sql import SparkSession
from pyspark.sql.types import \
    IntegerType, \
    StringType, \
    TimestampType, \
    DoubleType

c:\Users\GzuzC\OneDrive\Documents\Notes\Personal Studies\Workbooks and Worksheets\Python\PerScholas Data Engineering\perscholas_capstone_project\ignore\ETL-capstone-env\lib\site-packages\pyspark\pandas\__init__.py:49: UserWarning: 'PYARROW_IGNORE_TIMEZONE' environment variable was not set. It is required to set this environment variable to '1' in both driver and executor sides if you use pyarrow>=2.0.0. pandas-on-Spark will set it for you but it does not work if there is a Spark context already launched.
  warnings.warn(

In [2]:
session = SparkSession.builder.appName('Credit Card ETL').getOrCreate()

In [3]:
session

## Extract:
---
- Customer
- Branch
- Credit

In [4]:
customer_df = session.read.load('../data/credit_card_dataset/cdw_sapp_custmer.json', format='json')

In [4]:
branch_df = session.read.load('../data/credit_card_dataset/cdw_sapp_branch.json', format='json')

In [61]:
credit_df = session.read.load('../data/credit_card_dataset/cdw_sapp_credit.json', format='json')

In [232]:
#customer_df_dirty_backup = customer_df
branch_df_dirty_backup = branch_df
credit_df_dirty_backup = credit_df

## Transform
---

### Data Validation
- Ensure Correct Schema, View Current DataTypes
- Determine if any null values

In [235]:
print("Customer DataFrame:\n")
#customer_df.printSchema()
print("\nBranch DataFrame:\n")
branch_df.printSchema()
print("\nCredit DataFrame:\n")
branch_df.printSchema()

Customer DataFrame:


Branch DataFrame:

root
 |-- BRANCH_CITY: string (nullable = true)
 |-- BRANCH_CODE: long (nullable = true)
 |-- BRANCH_NAME: string (nullable = true)
 |-- BRANCH_PHONE: string (nullable = true)
 |-- BRANCH_STATE: string (nullable = true)
 |-- BRANCH_STREET: string (nullable = true)
 |-- BRANCH_ZIP: long (nullable = true)
 |-- LAST_UPDATED: string (nullable = true)


Credit DataFrame:

root
 |-- BRANCH_CITY: string (nullable = true)
 |-- BRANCH_CODE: long (nullable = true)
 |-- BRANCH_NAME: string (nullable = true)
 |-- BRANCH_PHONE: string (nullable = true)
 |-- BRANCH_STATE: string (nullable = true)
 |-- BRANCH_STREET: string (nullable = true)
 |-- BRANCH_ZIP: long (nullable = true)
 |-- LAST_UPDATED: string (nullable = true)

In [9]:
def null_checker(dataframe):
    original_count= dataframe.count()
    drop_na = dataframe.dropna()
    new_count = drop_na.count()
    if new_count != original_count:
        print(f"Original Number of Rows: {original_count} \
            \nNew Number of Rows: {new_count}\n")
    else:
        print("No nulls, no changes made\n")

In [10]:
null_checker(customer_df)
null_checker(branch_df)
null_checker(credit_df)

No nulls, no changes made

No nulls, no changes made

No nulls, no changes made

### Casting Correct Data Types

In [86]:
#test = customer_df.select(customer_df['SSN'], customer_df['SSN'].cast("INT"))

In [11]:
customer_df.createOrReplaceTempView("customer_df")

In [25]:
# this technique is the fastest way to convert datatypes without running a loop on .withColumn 
# to prevent potential performance loss or crashing
customer_df_transformed = customer_df.withColumns({'SSN':customer_df['SSN'].cast(IntegerType()), 
                                  'CUST_ZIP':customer_df['CUST_ZIP'].cast(IntegerType()),
                                  'CUST_PHONE':customer_df['CUST_PHONE'].cast(StringType()),
                                  'LAST_UPDATED':customer_df['LAST_UPDATED'].cast(TimestampType())})

In [13]:
print("Transformed:\n")
customer_df_transformed.printSchema()
print("\nOriginal:\n")
customer_df.printSchema()

Transformed:

root
 |-- APT_NO: string (nullable = true)
 |-- CREDIT_CARD_NO: string (nullable = true)
 |-- CUST_CITY: string (nullable = true)
 |-- CUST_COUNTRY: string (nullable = true)
 |-- CUST_EMAIL: string (nullable = true)
 |-- CUST_PHONE: string (nullable = true)
 |-- CUST_STATE: string (nullable = true)
 |-- CUST_ZIP: integer (nullable = true)
 |-- FIRST_NAME: string (nullable = true)
 |-- LAST_NAME: string (nullable = true)
 |-- LAST_UPDATED: timestamp (nullable = true)
 |-- MIDDLE_NAME: string (nullable = true)
 |-- SSN: integer (nullable = true)
 |-- STREET_NAME: string (nullable = true)


Original:

root
 |-- APT_NO: string (nullable = true)
 |-- CREDIT_CARD_NO: string (nullable = true)
 |-- CUST_CITY: string (nullable = true)
 |-- CUST_COUNTRY: string (nullable = true)
 |-- CUST_EMAIL: string (nullable = true)
 |-- CUST_PHONE: long (nullable = true)
 |-- CUST_STATE: string (nullable = true)
 |-- CUST_ZIP: string (nullable = true)
 |-- FIRST_NAME: string (nullable = true)
 |-- LAST_NAME: string (nullable = true)
 |-- LAST_UPDATED: string (nullable = true)
 |-- MIDDLE_NAME: string (nullable = true)
 |-- SSN: long (nullable = true)
 |-- STREET_NAME: string (nullable = true)

### Transforming Single Columns

In [24]:
import time
# I want to determine if using a pandas api layer on spark would be faster while running locally, or a direct pandas dataframe
# I confirmed that it is just faster to use a pandas dataframe while running locally as opposed to the pandas API layer

In [26]:
customer_df_transformed_backup = customer_df_transformed

In [27]:
customer_df_transformed_pandas_api = customer_df_transformed.pandas_api()

In [70]:
customer_df_transformed_pandas_direct = customer_df_transformed.toPandas()

c:\Users\GzuzC\OneDrive\Documents\Notes\Personal Studies\Workbooks and Worksheets\Python\PerScholas Data Engineering\perscholas_capstone_project\ignore\ETL-capstone-env\lib\site-packages\pyspark\sql\pandas\conversion.py:248: FutureWarning: Passing unit-less datetime64 dtype to .astype is deprecated and will raise in a future version. Pass 'datetime64[ns]' instead
  series = series.astype(t, copy=False)

In [51]:
start_api = time.time()
middle_name_api = customer_df_transformed_pandas_api['MIDDLE_NAME'].apply(lambda x: str(x).lower())
end_api = time.time()

c:\Users\GzuzC\OneDrive\Documents\Notes\Personal Studies\Workbooks and Worksheets\Python\PerScholas Data Engineering\perscholas_capstone_project\ignore\ETL-capstone-env\lib\site-packages\pyspark\pandas\internal.py:1573: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  fields = [
c:\Users\GzuzC\OneDrive\Documents\Notes\Personal Studies\Workbooks and Worksheets\Python\PerScholas Data Engineering\perscholas_capstone_project\ignore\ETL-capstone-env\lib\site-packages\pyspark\sql\pandas\conversion.py:486: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for column, series in pdf.iteritems():

In [52]:
print(f"{end_api - start_api}")

0.15231633186340332

In [47]:
middle_name_api

0              wm
1         brendan
2        ezequiel
3           trina
4             may
5         ambrose
6           larry
7             ora
8          tracie
9         mitchel
10          denny
11       isabelle
12          henry
13         rickey
14      heriberto
15       angelita
16       dorothea
17      jefferson
18         maximo
19        arnulfo
20         ramiro
21        nanette
22       isabella
23          edith
24        jacklyn
25          lorna
26         debora
27          tomas
28       carolina
29        shannon
30         austin
31         lorrie
32           phil
33          britt
34        chasity
35        mildred
36            ted
37        gonzalo
38         harvey
39         andrew
40         corina
41           oren
42          cathy
43        raleigh
44          scott
45         santos
46       jennifer
47        rosario
48         leonor
49       laurence
50           erin
51          brain
52         antone
53       mercedes
54           aida
55        beatriz
56           jame
57          aimee
58         marion
59        annette
60         dionne
61         doreen
62        thurman
63         angelo
64        leonard
65        refugio
66          bette
67        coleman
68         alissa
69            may
70        donnell
71         manual
72         millie
73         deanne
74        claudia
75        rodrick
76           alan
77            lee
78        desiree
79          ronny
80        marcelo
81       porfirio
82         anibal
83        herbert
84       beatrice
85     bernadette
86           lucy
87       emmanuel
88         prince
89      granville
90       eldridge
91         sylvia
92       valentin
93            iva
94         kelsey
95      cornelius
96       kathrine
97        jocelyn
98        nanette
99          lorna
100       pearlie
101          erin
102       carmela
103      chauncey
104       justine
105          joan
106         steve
107         sonia
108       natalia
109        dwayne
110        laurie
111        tamika
112        leslie
113       rosanna
114      ashleigh
115        gloria
116      eldridge
117      bernardo
118        carrie
119        graham
120          jake
121           ana
122      isabella
123        warner
124         logan
125           ron
126          lacy
127         sally
128       normand
129        rudolf
130       marissa
131        barton
132          mike
133       milford
134       latisha
135       cedrick
136         myrna
137      mauricio
138      michelle
139         lorie
140          lola
141           amy
142          jana
143        margot
144      herminia
145         joyce
146        dewitt
147       wendell
148        carson
149       winford
150         billy
151        freida
152        burton
153           kip
154       renaldo
155        brooks
156        grover
157         ernie
158        elinor
159       chandra
160        lorrie
161       terence
162           kim
163           ola
164       loretta
165        eloise
166         janna
167          elma
168         clara
169         tasha
170         kevin
171        sammie
172       sherman
173         ronny
174        alyson
175         bobby
176        markus
177       rodrick
178       blanche
179       roseann
180         jamey
181          chad
182       ernesto
183        barney
184       patrica
185         dayna
186     esperanza
187          fern
188           von
189       johanna
190       angelia
191        tamika
192           mai
193         tania
194         wyatt
195        cecile
196            bo
197        isabel
198         tyron
199     zachariah
200       letitia
201         brice
202         carlo
203          nell
204        violet
205      josefina
206          john
207          saul
208          troy
209          enid
210       valarie
211     rosemarie
212        werner
213          emil
214       colleen
215        jasper
216        rowena
217         elton
218        edwina
219          kari
220         traci
221           abe
222       william
223         james
224         wyatt
225        johnie
226      geoffrey
227       alfreda
228          cary
229         silas
230          hong
231       jeffrey
232        damian
233        steven
234        debbie
235        jolene
236      jonathon
237        janice
238         cecil
239          reva
240        isabel
241       shelton
242      kendrick
243        carter
244          stan
245         marci
246         loren
247          jean
248          dane
249        graham
250        corina
251        josefa
252          mark
253       cecelia
254        juliet
255         shana
256         sonja
257        manuel
258           lee
259       rayford
260        esther
261        kelley
262        trevor
263       carmine
264    concepcion
265         lanny
266         allen
267          joan
268         renee
269        kelsey
270        arnold
271        jerrod
272         royal
273     johnathon
274       domingo
275       delbert
276      kristine
277           ana
278           rex
279       jeffrey
280        ashlee
281       rudolph
282       branden
283           mia
284        virgie
285         elias
286      norberto
287         kerry
288          lisa
289         toney
290        debbie
291        lowell
292       letitia
293      meredith
294           max
295        alexis
296       heather
297      giuseppe
298        keenan
299       nichole
300      jermaine
301       lourdes
302       pearlie
303          paul
304        damien
305         brent
306          thad
307        isreal
308         bryon
309         ollie
310         jerry
311        ruthie
312        simone
313         tyron
314         diane
315       monique
316         elton
317        wesley
318         ilene
319       maynard
320          lyle
321         enoch
322         kirby
323        kelley
324         jayne
325         joyce
326         odell
327       shirley
328        leslie
329     zachariah
330        doreen
331       oswaldo
332         cathy
333        marian
334         vicki
335          lila
336         boris
337         thanh
338        roslyn
339        jackie
340        lenore
341         benny
342        krista
343        jeromy
344         wilda
345        maxine
346         jesus
347         cesar
348           kim
349       lindsay
350        george
351        mattie
352       solomon
353       laverne
354        oliver
355         joyce
356         jayne
357        carson
358           lee
359           kim
360      leopoldo
361       haywood
362        elaine
363        denice
364       frankie
365         kirby
366        julian
367     francesco
368       marlene
369        lenora
370         emily
371         irwin
372       randall
373       gabriel
374        marvin
375      randolph
376       marcelo
377        stella
378       andreas
379      courtney
380         lidia
381        marcie
382         rubin
383       britney
384           rey
385        antony
386        sydney
387         sheri
388       jacinto
389           fay
390     dominique
391        connie
392         rhoda
393         orval
394       maribel
395        sophie
396       liliana
397          enid
398           jed
399       kristie
400        damien
401         mavis
402       kaitlin
403     christine
404       vincent
405       justine
406       antonio
407         lonny
408         nikki
409        miriam
410       natasha
411         sarah
412      terrance
413         ahmad
414          leta
415     roosevelt
416        helene
417         clair
418         angie
419           ina
420         faith
421        vaughn
422        manual
423           liz
424          rose
425        olivia
426        jannie
427         leroy
428       jerrold
429           hal
430           jan
431        trevor
432        regina
433        shelby
434         kraig
435     bridgette
436        samuel
437       tristan
438       deandre
439        dewitt
440           ora
441          abel
442          shad
443         brock
444         ahmad
445         jerry
446        jayson
447         josef
448        leland
449         helen
450        collin
451         gregg
452         lorie
453           sid
454       sabrina
455          lara
456       wendell
457       cecelia
458         marla
459         logan
460          theo
461      adrienne
462           noe
463       heather
464        geneva
465         alice
466         molly
467         juana
468       matthew
469        ashley
470          dirk
471          neil
472       cornell
473         carey
474       francis
475         britt
476           noe
477       patrick
478      leopoldo
479        ramiro
480        dalton
481         larry
482          edna
483       terrell
484        claire
485        johnie
486       tristan
487         louis
488        eloise
489      alphonso
490         rufus
491        roslyn
492         hilda
493      lorraine
494      santiago
495        dorsey
496      benedict
497       minerva
498        damian
499         tonia
500        tommie
501         mindy
502           lee
503          earl
504         clara
505      beatrice
506         chase
507        elisha
508        elisha
509         kirby
510         earle
511       camille
512        ramiro
513       solomon
514        lonnie
515        alissa
516         thanh
517       mariano
518          todd
519        terrie
520         kraig
521       horacio
522       carlton
523          dora
524         carla
525         pearl
526         danny
527       phillip
528         shane
529          gale
530      reginald
531      meredith
532         dayna
533     margarito
534         korey
535         kathi
536      gilberto
537        irving
538         boris
539       manuela
540        grover
541      dominick
542           tim
543      clarence
544         james
545            ma
546        odessa
547     margarita
548        freida
549      angeline
550          fern
551        harris
552        brooke
553         fidel
554        lesley
555          jean
556           art
557        dalton
558         myrna
559         homer
560        alvaro
561         anita
562       enrique
563        luella
564        reuben
565       justine
566       chandra
567      kristina
568      humberto
569        elinor
570     jeannette
571      kimberly
572        marcel
573     demetrius
574       clifton
575       sabrina
576         duane
577         brain
578       dominic
579       carmelo
580          geri
581        leland
582       laverne
583         bette
584       phyllis
585       celeste
586          deon
587         cyrus
588         casey
589       katrina
590        morton
591        jarred
592         dewey
593         gerry
594        bettie
595        chance
596         brant
597        walton
598         wilda
599       chelsey
600        mattie
601        wilton
602     alejandro
603        emilia
604       maryann
605       whitney
606        bianca
607           jae
608       cecilia
609        dessie
610          omer
611      patricia
612         jenny
613        pamela
614     francisca
615          eric
616       fredric
617          gina
618        connie
619      rosalind
620          cleo
621           ina
622       arnoldo
623         steve
624           ali
625       kristen
626         deann
627       carolyn
628         mauro
629        parker
630        martha
631          joan
632          neil
633       tabatha
634        arthur
635          avis
636       octavio
637      jeanette
638        emmett
639         basil
640         sonja
641        lenard
642      kimberly
643        dessie
644        carole
645         aimee
646        maggie
647          lena
648        emilie
649     priscilla
650        rickie
651       cynthia
652          oren
653           kim
654          jere
655         kathi
656        sylvia
657     francesco
658        howard
659         efren
660         mayra
661         diane
662         edwin
663        jordan
664       carmelo
665        joanne
666         bobby
667        harvey
668          dale
669     constance
670         terri
671         lauri
672          gwen
673        jamaal
674         ervin
675         duane
676          lola
677       lindsay
678        elnora
679     valentine
680       maurice
681      clifford
682          gino
683        andres
684       kristen
685        sierra
686         dusty
687          toby
688        alicia
689        werner
690      caroline
691        kristy
692       allison
693      eldridge
694          deon
695         brock
696            ty
697        luella
698       katrina
699         royce
700         rocky
701       dolores
702       vincent
703          rena
704      catalina
705         mauro
706       earlene
707         staci
708       cordell
709        karina
710          lena
711         stacy
712       clement
713      garfield
714        marcus
715          abel
716        meagan
717         lorna
718         hazel
719        celina
720        frieda
721         rubin
722         cheri
723       stephen
724           lea
725       jeannie
726        justin
727     kimberley
728           ike
729        rhonda
730        barney
731         selma
732          mike
733      hipolito
734       deirdre
735     ellsworth
736        eugene
737        elisha
738         agnes
739         verna
740          gwen
741      herminia
742        gussie
743         brain
744          brad
745         merle
746       edgardo
747        blaine
748       clayton
749         sarah
750       leticia
751         joyce
752     rosalinda
753        carrol
754       willard
755           gus
756       haywood
757          rory
758          luis
759         paige
760        foster
761            ma
762     angelique
763       kathryn
764      harriett
765         greta
766        israel
767         denis
768        connie
769        rowena
770       valeria
771          jade
772         kathi
773         jesus
774        victor
775         lorie
776      cristina
777         ruben
778         ronny
779           amy
780        vaughn
781      maricela
782     zachariah
783         caleb
784        fannie
785        anibal
786         faith
787         erica
788       hershel
789          neva
790       camille
791        lenore
792          chad
793         brain
794     gwendolyn
795          huey
796      courtney
797        keisha
798         mindy
799       bernard
800         noble
801        lorena
802     genevieve
803       rolando
804      harriett
805       marlene
806         elena
807         jimmy
808       madelyn
809      victoria
810        phoebe
811        olivia
812          fern
813         santo
814       carroll
815     ernestine
816        lorene
817        sherry
818       lucinda
819      kendrick
820        jolene
821       merrill
822      kendrick
823        ericka
824        barney
825       rebecca
826        elaine
827         terry
828        selina
829         roger
830         tonya
831       kirsten
832         mavis
833      geoffrey
834         dante
835          rudy
836          dona
837        silvia
838         della
839         lauri
840        erasmo
841          todd
842       raphael
843       katelyn
844         margo
845       zachary
846         robin
847         annie
848        tracey
849          mona
850       eduardo
851           jay
852        damien
853           lea
854     ellsworth
855       maurice
856     demetrius
857         carla
858        alexis
859        amelia
860     henrietta
861         oscar
862        cecile
863          alec
864         cyrus
865         elvis
866      fletcher
867       melinda
868       deandre
869         scott
870       milford
871         lauri
872           ron
873         caleb
874       jillian
875      dominick
876         verna
877         holly
878     charlotte
879          kory
880         tracy
881       loraine
882       spencer
883       beverly
884        irving
885          oren
886      harriett
887        melody
888        bobbie
889         marta
890        august
891         toney
892        quincy
893        jayson
894          abby
895         scott
896        brandi
897           ian
898      marjorie
899      rosalind
900         allie
901          eula
902      gabriela
903       ambrose
904        marian
905         terra
906          loyd
907         madge
908    concepcion
909         nicky
910         elroy
911          joni
912         benny
913       rudolph
914        antone
915        deanna
916         robin
917          odis
918      trinidad
919          elda
920         angel
921        booker
922         abdul
923      penelope
924       carlton
925           guy
926     catherine
927        vickie
928        leslie
929       candace
930        freida
931        isabel
932       flossie
933       cathryn
934       donnell
935       alfreda
936         terry
937      marietta
938          sara
939          kyle
940       dorothy
941     katherine
942       johnson
943          ezra
944      ashleigh
945      marietta
946         jerry
947         jonah
948          aron
949         lucas
950       susanna
951         jaime
Name: MIDDLE_NAME, dtype: object

In [53]:
start_pandas = time.time()
middle_name_pandas = customer_df_transformed_pandas_direct['MIDDLE_NAME'].apply(lambda x: str(x).lower())
end_pandas = time.time()

In [54]:
print(f"{end_pandas - start_pandas}")

0.0010008811950683594

In [57]:
print(f"{((end_api - start_api)/(end_pandas - start_pandas))} Times Faster")

152.18222963315864 Times Faster

In [71]:
customer_df_transformed_pandas_direct['MIDDLE_NAME'] = middle_name_pandas

In [72]:
customer_df_transformed_pandas_direct.head(2)

,APT_NO,CREDIT_CARD_NO,CUST_CITY,CUST_COUNTRY,CUST_EMAIL,CUST_PHONE,CUST_STATE,CUST_ZIP,FIRST_NAME,LAST_NAME,LAST_UPDATED,MIDDLE_NAME,SSN,STREET_NAME
0,656,4210653310061055,Natchez,United States,AHooper@example.com,1237818,MS,39120,Alec,Hooper,2018-04-21 12:49:02,wm,123456100,Main Street North
1,829,4210653310102868,Wethersfield,United States,EHolman@example.com,1238933,CT,6109,Etta,Holman,2018-04-21 12:49:02,brendan,123453023,Redwood Drive

In [95]:
pandas_backup = customer_df_transformed_pandas_direct  # clean this up later

In [99]:
customer_df_transformed_pandas_direct = pandas_backup

In [100]:
for name in ['FIRST_NAME', 'LAST_NAME']:
    customer_df_transformed_pandas_direct[name] = customer_df_transformed_pandas_direct[name].apply(lambda x: str(x).title())

In [111]:
customer_df_transformed_pandas_direct

,APT_NO,CREDIT_CARD_NO,CUST_CITY,CUST_COUNTRY,CUST_EMAIL,CUST_PHONE,CUST_STATE,CUST_ZIP,FIRST_NAME,LAST_NAME,LAST_UPDATED,MIDDLE_NAME,SSN,STREET_NAME
0,656,4210653310061055,Natchez,United States,AHooper@example.com,1237818,MS,39120,Alec,Hooper,2018-04-21 12:49:02,wm,123456100,Main Street North
1,829,4210653310102868,Wethersfield,United States,EHolman@example.com,1238933,CT,6109,Etta,Holman,2018-04-21 12:49:02,brendan,123453023,Redwood Drive
2,683,4210653310116272,Huntley,United States,WDunham@example.com,1243018,IL,60142,Wilber,Dunham,2018-04-21 12:49:02,ezequiel,123454487,12th Street East
3,253,4210653310195948,NewBerlin,United States,EHardy@example.com,1243215,WI,53151,Eugenio,Hardy,2018-04-21 12:49:02,trina,123459758,Country Club Road
4,301,4210653310356919,ElPaso,United States,WAyers@example.com,1242074,TX,79930,Wilfred,Ayers,2018-04-21 12:49:02,may,123454431,Madison Street
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
947,882,4210653399559239,SiouxCity,United States,FCastle@example.com,1238344,IA,51106,Freida,Castle,2018-04-21 12:49:02,jonah,123451589,Main Street South
948,470,4210653399650358,Summerville,United States,FBlock@example.com,1240420,SC,29483,Fern,Block,2018-04-21 12:49:02,aron,123457088,Glenwood Avenue
949,405,4210653399732638,Duluth,United States,DPruitt@example.com,1236149,GA,30096,Dylan,Pruitt,2018-04-21 12:49:02,lucas,123453259,Country Lane
950,15,4210653399859149,Rowlett,United States,EBeatty@example.com,1236886,TX,75088,Emery,Beatty,2018-04-21 12:49:02,susanna,123454047,8th Street
951,67,4210653399939240,SanLorenzo,United States,PMullen@example.com,1237017,CA,94580,Phil,Mullen,2018-04-21 12:49:02,jaime,123454500,Charles Street

In [114]:
customer_df_transformed_pandas_direct['CUST_PHONE']
print(len(customer_df_transformed_pandas_direct['CUST_PHONE'].iloc[0])) # missing area code, 7nums

print(len(customer_df_transformed_pandas_direct['CUST_CITY'].unique()))  # 151 diff area codes, just 555 for now

7
151

In [115]:
customer_df_transformed_pandas_direct['CUST_PHONE'] = customer_df_transformed_pandas_direct['CUST_PHONE'].apply(lambda x: "(555)" + str(x))

In [116]:
customer_df_transformed_pandas_direct

,APT_NO,CREDIT_CARD_NO,CUST_CITY,CUST_COUNTRY,CUST_EMAIL,CUST_PHONE,CUST_STATE,CUST_ZIP,FIRST_NAME,LAST_NAME,LAST_UPDATED,MIDDLE_NAME,SSN,STREET_NAME
0,656,4210653310061055,Natchez,United States,AHooper@example.com,(555)1237818,MS,39120,Alec,Hooper,2018-04-21 12:49:02,wm,123456100,Main Street North
1,829,4210653310102868,Wethersfield,United States,EHolman@example.com,(555)1238933,CT,6109,Etta,Holman,2018-04-21 12:49:02,brendan,123453023,Redwood Drive
2,683,4210653310116272,Huntley,United States,WDunham@example.com,(555)1243018,IL,60142,Wilber,Dunham,2018-04-21 12:49:02,ezequiel,123454487,12th Street East
3,253,4210653310195948,NewBerlin,United States,EHardy@example.com,(555)1243215,WI,53151,Eugenio,Hardy,2018-04-21 12:49:02,trina,123459758,Country Club Road
4,301,4210653310356919,ElPaso,United States,WAyers@example.com,(555)1242074,TX,79930,Wilfred,Ayers,2018-04-21 12:49:02,may,123454431,Madison Street
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
947,882,4210653399559239,SiouxCity,United States,FCastle@example.com,(555)1238344,IA,51106,Freida,Castle,2018-04-21 12:49:02,jonah,123451589,Main Street South
948,470,4210653399650358,Summerville,United States,FBlock@example.com,(555)1240420,SC,29483,Fern,Block,2018-04-21 12:49:02,aron,123457088,Glenwood Avenue
949,405,4210653399732638,Duluth,United States,DPruitt@example.com,(555)1236149,GA,30096,Dylan,Pruitt,2018-04-21 12:49:02,lucas,123453259,Country Lane
950,15,4210653399859149,Rowlett,United States,EBeatty@example.com,(555)1236886,TX,75088,Emery,Beatty,2018-04-21 12:49:02,susanna,123454047,8th Street
951,67,4210653399939240,SanLorenzo,United States,PMullen@example.com,(555)1237017,CA,94580,Phil,Mullen,2018-04-21 12:49:02,jaime,123454500,Charles Street

In [119]:
customer_transformed_df = session.createDataFrame(customer_df_transformed_pandas_direct)

c:\Users\GzuzC\OneDrive\Documents\Notes\Personal Studies\Workbooks and Worksheets\Python\PerScholas Data Engineering\perscholas_capstone_project\ignore\ETL-capstone-env\lib\site-packages\pyspark\sql\pandas\conversion.py:474: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for column, series in pdf.iteritems():
c:\Users\GzuzC\OneDrive\Documents\Notes\Personal Studies\Workbooks and Worksheets\Python\PerScholas Data Engineering\perscholas_capstone_project\ignore\ETL-capstone-env\lib\site-packages\pyspark\sql\pandas\conversion.py:486: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for column, series in pdf.iteritems():

In [120]:
customer_transformed_df.printSchema()

root
 |-- APT_NO: string (nullable = true)
 |-- CREDIT_CARD_NO: string (nullable = true)
 |-- CUST_CITY: string (nullable = true)
 |-- CUST_COUNTRY: string (nullable = true)
 |-- CUST_EMAIL: string (nullable = true)
 |-- CUST_PHONE: string (nullable = true)
 |-- CUST_STATE: string (nullable = true)
 |-- CUST_ZIP: long (nullable = true)
 |-- FIRST_NAME: string (nullable = true)
 |-- LAST_NAME: string (nullable = true)
 |-- LAST_UPDATED: timestamp (nullable = true)
 |-- MIDDLE_NAME: string (nullable = true)
 |-- SSN: long (nullable = true)
 |-- STREET_NAME: string (nullable = true)

In [121]:
customer_transformed_df.show(2)

+------+----------------+------------+-------------+-------------------+------------+----------+--------+----------+---------+-------------------+-----------+---------+-----------------+
|APT_NO|  CREDIT_CARD_NO|   CUST_CITY| CUST_COUNTRY|         CUST_EMAIL|  CUST_PHONE|CUST_STATE|CUST_ZIP|FIRST_NAME|LAST_NAME|       LAST_UPDATED|MIDDLE_NAME|      SSN|      STREET_NAME|
+------+----------------+------------+-------------+-------------------+------------+----------+--------+----------+---------+-------------------+-----------+---------+-----------------+
|   656|4210653310061055|     Natchez|United States|AHooper@example.com|(555)1237818|        MS|   39120|      Alec|   Hooper|2018-04-21 12:49:02|         wm|123456100|Main Street North|
|   829|4210653310102868|Wethersfield|United States|EHolman@example.com|(555)1238933|        CT|    6109|      Etta|   Holman|2018-04-21 12:49:02|    brendan|123453023|    Redwood Drive|
+------+----------------+------------+-------------+-------------------+------------+----------+--------+----------+---------+-------------------+-----------+---------+-----------------+
only showing top 2 rows

In [123]:
customer_transformed_df.createOrReplaceTempView('customer_df')

In [125]:
open_query = session.sql("""
SELECT *
FROM 
customer_df
""")

In [126]:
open_query.show(2)

+------+----------------+------------+-------------+-------------------+------------+----------+--------+----------+---------+-------------------+-----------+---------+-----------------+
|APT_NO|  CREDIT_CARD_NO|   CUST_CITY| CUST_COUNTRY|         CUST_EMAIL|  CUST_PHONE|CUST_STATE|CUST_ZIP|FIRST_NAME|LAST_NAME|       LAST_UPDATED|MIDDLE_NAME|      SSN|      STREET_NAME|
+------+----------------+------------+-------------+-------------------+------------+----------+--------+----------+---------+-------------------+-----------+---------+-----------------+
|   656|4210653310061055|     Natchez|United States|AHooper@example.com|(555)1237818|        MS|   39120|      Alec|   Hooper|2018-04-21 12:49:02|         wm|123456100|Main Street North|
|   829|4210653310102868|Wethersfield|United States|EHolman@example.com|(555)1238933|        CT|    6109|      Etta|   Holman|2018-04-21 12:49:02|    brendan|123453023|    Redwood Drive|
+------+----------------+------------+-------------+-------------------+------------+----------+--------+----------+---------+-------------------+-----------+---------+-----------------+
only showing top 2 rows

In [131]:
concat = session.sql("""
SELECT *, CONCAT(STREET_NAME, ', ', APT_NO) AS FULL_STREET_ADDRESS
FROM customer_df
""")

In [132]:
concat.show(truncate=False)

+------+----------------+------------+-------------+----------------------+------------+----------+--------+----------+---------+-------------------+-----------+---------+-----------------+----------------------+
|APT_NO|CREDIT_CARD_NO  |CUST_CITY   |CUST_COUNTRY |CUST_EMAIL            |CUST_PHONE  |CUST_STATE|CUST_ZIP|FIRST_NAME|LAST_NAME|LAST_UPDATED       |MIDDLE_NAME|SSN      |STREET_NAME      |FULL_STREET_ADDRESS   |
+------+----------------+------------+-------------+----------------------+------------+----------+--------+----------+---------+-------------------+-----------+---------+-----------------+----------------------+
|656   |4210653310061055|Natchez     |United States|AHooper@example.com   |(555)1237818|MS        |39120   |Alec      |Hooper   |2018-04-21 12:49:02|wm         |123456100|Main Street North|Main Street North, 656|
|829   |4210653310102868|Wethersfield|United States|EHolman@example.com   |(555)1238933|CT        |6109    |Etta      |Holman   |2018-04-21 12:49:02|brendan    |123453023|Redwood Drive    |Redwood Drive, 829    |
|683   |4210653310116272|Huntley     |United States|WDunham@example.com   |(555)1243018|IL        |60142   |Wilber    |Dunham   |2018-04-21 12:49:02|ezequiel   |123454487|12th Street East |12th Street East, 683 |
|253   |4210653310195948|NewBerlin   |United States|EHardy@example.com    |(555)1243215|WI        |53151   |Eugenio   |Hardy    |2018-04-21 12:49:02|trina      |123459758|Country Club Road|Country Club Road, 253|
|301   |4210653310356919|ElPaso      |United States|WAyers@example.com    |(555)1242074|TX        |79930   |Wilfred   |Ayers    |2018-04-21 12:49:02|may        |123454431|Madison Street   |Madison Street, 301   |
|3     |4210653310395982|NorthOlmsted|United States|BWoodard@example.com  |(555)1242570|OH        |44070   |Beau      |Woodard  |2018-04-21 12:49:02|ambrose    |123454202|Colonial Drive   |Colonial Drive, 3     |
|84    |4210653310400536|Vienna      |United States|SKemp@example.com     |(555)1239685|VA        |22180   |Sheila    |Kemp     |2018-04-21 12:49:02|larry      |123451799|Belmont Avenue   |Belmont Avenue, 84    |
|728   |4210653310459911|Duarte      |United States|WHurley@example.com   |(555)1238213|CA        |91010   |Wendy     |Hurley   |2018-04-21 12:49:02|ora        |123453875|Oxford Court     |Oxford Court, 728     |
|81    |4210653310773972|Owosso      |United States|AGilmore@example.com  |(555)1240689|MI        |48867   |Alec      |Gilmore  |2018-04-21 12:49:02|tracie     |123457511|Forest Street    |Forest Street, 81     |
|561   |4210653310794854|Zion        |United States|BLau@example.com      |(555)1235222|IL        |60099   |Barbra    |Lau      |2018-04-21 12:49:02|mitchel    |123457464|Court Street     |Court Street, 561     |
|622   |4210653310817373|Youngstown  |United States|EThomson@example.com  |(555)1241363|OH        |44512   |Edmundo   |Thomson  |2018-04-21 12:49:02|denny      |123457639|Cypress Court    |Cypress Court, 622    |
|924   |4210653310844617|Summerville |United States|ETruong@example.com   |(555)1236228|SC        |29483   |Elsa      |Truong   |2018-04-21 12:49:02|isabelle   |123453242|8th Street West  |8th Street West, 924  |
|611   |4210653311015303|ElPaso      |United States|HMckinney@example.com |(555)1238165|TX        |79930   |Homer     |Mckinney |2018-04-21 12:49:02|henry      |123454339|East Avenue      |East Avenue, 611      |
|680   |4210653311215039|Fenton      |United States|RKidd@example.com     |(555)1234730|MI        |48430   |Rita      |Kidd     |2018-04-21 12:49:02|rickey     |123454537|Route 44         |Route 44, 680         |
|71    |4210653311229354|Grandville  |United States|ABallard@example.com  |(555)1242113|MI        |49418   |Amalia    |Ballard  |2018-04-21 12:49:02|heriberto  |123452373|Warren Street    |Warren Street, 71     |
|195   |4210653311652836|YubaCity    |United States|PThomas@example.com   |(555)1239888|CA        |95993   |Patty     |Thomas   |2018-04-21 12:49:02|angelita   |123455343|Jones Street     |Jones Street, 195     |
|500   |4210653311707126|CapeCoral   |United States|JMorrow@example.com   |(555)1240158|FL        |33904   |Josefina  |Morrow   |2018-04-21 12:49:02|dorothea   |123451533|New Street       |New Street, 500       |
|989   |4210653311730764|Brookfield  |United States|NAndrews@example.com  |(555)1241408|WI        |53045   |Nelson    |Andrews  |2018-04-21 12:49:02|jefferson  |123459278|Division Street  |Division Street, 989  |
|810   |4210653311898082|Richmond    |United States|MSchneider@example.com|(555)1238390|VA        |23223   |Miquel    |Schneider|2018-04-21 12:49:02|maximo     |123456915|Maple Street     |Maple Street, 810     |
|649   |4210653312021765|WestChester |United States|PTidwell@example.com  |(555)1235067|PA        |19380   |Parker    |Tidwell  |2018-04-21 12:49:02|arnulfo    |123453807|Eagle Road       |Eagle Road, 649       |
+------+----------------+------------+-------------+----------------------+------------+----------+--------+----------+---------+-------------------+-----------+---------+-----------------+----------------------+
only showing top 20 rows

In [130]:
customer_transformed_df_backup = customer_transformed_df

In [140]:
customer_transformed_df = concat.drop('STREET_NAME')
customer_transformed_df = customer_transformed_df.drop('APT_NO')

In [142]:
customer_transformed_df.show(2, truncate=False)

+----------------+------------+-------------+-------------------+------------+----------+--------+----------+---------+-------------------+-----------+---------+----------------------+
|CREDIT_CARD_NO  |CUST_CITY   |CUST_COUNTRY |CUST_EMAIL         |CUST_PHONE  |CUST_STATE|CUST_ZIP|FIRST_NAME|LAST_NAME|LAST_UPDATED       |MIDDLE_NAME|SSN      |FULL_STREET_ADDRESS   |
+----------------+------------+-------------+-------------------+------------+----------+--------+----------+---------+-------------------+-----------+---------+----------------------+
|4210653310061055|Natchez     |United States|AHooper@example.com|(555)1237818|MS        |39120   |Alec      |Hooper   |2018-04-21 12:49:02|wm         |123456100|Main Street North, 656|
|4210653310102868|Wethersfield|United States|EHolman@example.com|(555)1238933|CT        |6109    |Etta      |Holman   |2018-04-21 12:49:02|brendan    |123453023|Redwood Drive, 829    |
+----------------+------------+-------------+-------------------+------------+----------+--------+----------+---------+-------------------+-----------+---------+----------------------+
only showing top 2 rows

In [186]:
# NOTE: pull in mapping doc csv's
# use pandas to grap the types and convert, clean this up later

def type_check(dataframe, data_types):
    schema_list = dataframe.schema.simpleString().split(",")
    #schema_list = customer_transformed_df.schema.simpleString().split(",")
    print(len(schema_list))
    print(len(data_types))
    for num, schema in enumerate(schema_list):

        
        type = schema.split(":")
        if type[1] != data_types[num]:
            print(f"Datatype mis-match: {type[0]} does not match required type, {data_types[num]}\n")
        else:
            print(f"{type[0]} matches required type {data_types[num]}\n")

In [ ]:
types = ['string', 'string', 'string', 'string', 'string', 'int', 'string', 'string', 'timestamp', 'string', 'int', 'string', 'string']
type_check(customer_transformed_df, types)

In [190]:
customer_transformed_df.printSchema()

root
 |-- CREDIT_CARD_NO: string (nullable = true)
 |-- CUST_CITY: string (nullable = true)
 |-- CUST_COUNTRY: string (nullable = true)
 |-- CUST_EMAIL: string (nullable = true)
 |-- CUST_PHONE: string (nullable = true)
 |-- CUST_STATE: string (nullable = true)
 |-- CUST_ZIP: long (nullable = true)
 |-- FIRST_NAME: string (nullable = true)
 |-- LAST_NAME: string (nullable = true)
 |-- LAST_UPDATED: timestamp (nullable = true)
 |-- MIDDLE_NAME: string (nullable = true)
 |-- SSN: long (nullable = true)
 |-- FULL_STREET_ADDRESS: string (nullable = true)

In [225]:
customer_transformed_df.coalesce(1).write.json(path='../data/credit_card_dataset_transformed/customer_transformed.json')
# NOTE:
# This took me WAY TOO LONG to figure out, pyspark documentation is def not as robust as pandas

In [269]:
requirements_df = pd.read_clipboard()  # read straight from requirements

In [270]:
requirements_df

  Source File Column Names Target DataType
0              BRANCH_CODE             INT
1              BRANCH_NAME         VARCHAR
2            BRANCH_STREET         VARCHAR
3              BRANCH_CITY         VARCHAR
4             BRANCH_STATE         VARCHAR
5               BRANCH_ZIP             INT
6             BRANCH_PHONE         VARCHAR
7             LAST_UPDATED       TIMESTAMP

In [273]:
requirements_df.sort_values('Source File Column Names')

  Source File Column Names Target DataType
3              BRANCH_CITY         VARCHAR
0              BRANCH_CODE             INT
1              BRANCH_NAME         VARCHAR
6             BRANCH_PHONE         VARCHAR
4             BRANCH_STATE         VARCHAR
2            BRANCH_STREET         VARCHAR
5               BRANCH_ZIP             INT
7             LAST_UPDATED       TIMESTAMP

In [5]:
branch_df = branch_df.withColumn('LAST_UPDATED', branch_df['LAST_UPDATED'].cast(TimestampType()))

In [6]:
branch_df.show(2)

+-----------+-----------+------------+------------+------------+-----------------+----------+-------------------+
|BRANCH_CITY|BRANCH_CODE| BRANCH_NAME|BRANCH_PHONE|BRANCH_STATE|    BRANCH_STREET|BRANCH_ZIP|       LAST_UPDATED|
+-----------+-----------+------------+------------+------------+-----------------+----------+-------------------+
|  Lakeville|          1|Example Bank|  1234565276|          MN|     Bridle Court|     55044|2018-04-18 16:51:47|
|    Huntley|          2|Example Bank|  1234618993|          IL|Washington Street|     60142|2018-04-18 16:51:47|
+-----------+-----------+------------+------------+------------+-----------------+----------+-------------------+
only showing top 2 rows

In [7]:
branch_df.printSchema()

root
 |-- BRANCH_CITY: string (nullable = true)
 |-- BRANCH_CODE: long (nullable = true)
 |-- BRANCH_NAME: string (nullable = true)
 |-- BRANCH_PHONE: string (nullable = true)
 |-- BRANCH_STATE: string (nullable = true)
 |-- BRANCH_STREET: string (nullable = true)
 |-- BRANCH_ZIP: long (nullable = true)
 |-- LAST_UPDATED: timestamp (nullable = true)

In [18]:
branch_df.createOrReplaceTempView('branch_df')

In [23]:
check = session.sql("""
SELECT *
FROM branch_df
WHERE BRANCH_ZIP is NULL

""")

In [24]:
branch_df = branch_df.fillna({"BRANCH_ZIP":99999})

In [29]:
branch_df_p = branch_df.toPandas()

c:\Users\GzuzC\OneDrive\Documents\Notes\Personal Studies\Workbooks and Worksheets\Python\PerScholas Data Engineering\perscholas_capstone_project\ignore\ETL-capstone-env\lib\site-packages\pyspark\sql\pandas\conversion.py:248: FutureWarning: Passing unit-less datetime64 dtype to .astype is deprecated and will raise in a future version. Pass 'datetime64[ns]' instead
  series = series.astype(t, copy=False)

In [31]:
branch_df_p.dtypes

BRANCH_CITY              object
BRANCH_CODE               int64
BRANCH_NAME              object
BRANCH_PHONE             object
BRANCH_STATE             object
BRANCH_STREET            object
BRANCH_ZIP                int64
LAST_UPDATED     datetime64[ns]
dtype: object

In [32]:
branch_df_p

,BRANCH_CITY,BRANCH_CODE,BRANCH_NAME,BRANCH_PHONE,BRANCH_STATE,BRANCH_STREET,BRANCH_ZIP,LAST_UPDATED
0,Lakeville,1,Example Bank,1234565276,MN,Bridle Court,55044,2018-04-18 16:51:47
1,Huntley,2,Example Bank,1234618993,IL,Washington Street,60142,2018-04-18 16:51:47
2,SouthRichmondHill,3,Example Bank,1234985926,NY,Warren Street,11419,2018-04-18 16:51:47
3,Middleburg,4,Example Bank,1234663064,FL,Cleveland Street,32068,2018-04-18 16:51:47
4,KingOfPrussia,5,Example Bank,1234849701,PA,14th Street,19406,2018-04-18 16:51:47
...,...,...,...,...,...,...,...,...
110,Baldwin,178,Example Bank,1234612707,NY,8th Street West,11510,2018-04-18 16:51:47
111,NewHaven,180,Example Bank,1234347181,CT,Meadow Street,6511,2018-04-18 16:51:47
112,Quincy,188,Example Bank,1234259065,MA,Lincoln Avenue,2169,2018-04-18 16:51:47
113,Lititz,192,Example Bank,1234937904,PA,Glenwood Drive,17543,2018-04-18 16:51:47
114,Acworth,197,Example Bank,1234914637,GA,Briarwood Drive,30101,2018-04-18 16:51:47

In [47]:
def parse_phone_number(phone_number):  # (xxx)xxx-xxxx
    phone_number = str(phone_number)
    if len(phone_number) == 10:
        phone_number = list(phone_number)
        phone_number.insert(0, "(")  # 0
        phone_number.insert(4, ")")  # 0, 1, 2 + 3 = 4
        phone_number.insert(-4, "-")
        return "".join(char for char in phone_number)
    else:
        pass

In [48]:
print(parse_phone_number("1234914637"))

(123)491-4637

In [50]:
branch_df_p['BRANCH_PHONE'] = branch_df_p['BRANCH_PHONE'].apply(parse_phone_number)

In [52]:
branch_df_p.head(10)

,BRANCH_CITY,BRANCH_CODE,BRANCH_NAME,BRANCH_PHONE,BRANCH_STATE,BRANCH_STREET,BRANCH_ZIP,LAST_UPDATED
0,Lakeville,1,Example Bank,(123)456-5276,MN,Bridle Court,55044,2018-04-18 16:51:47
1,Huntley,2,Example Bank,(123)461-8993,IL,Washington Street,60142,2018-04-18 16:51:47
2,SouthRichmondHill,3,Example Bank,(123)498-5926,NY,Warren Street,11419,2018-04-18 16:51:47
3,Middleburg,4,Example Bank,(123)466-3064,FL,Cleveland Street,32068,2018-04-18 16:51:47
4,KingOfPrussia,5,Example Bank,(123)484-9701,PA,14th Street,19406,2018-04-18 16:51:47
5,Paterson,7,Example Bank,(123)414-4890,NJ,Jefferson Street,7501,2018-04-18 16:51:47
6,Pittsford,8,Example Bank,(123)467-8272,NY,B Street,14534,2018-04-18 16:51:47
7,Wethersfield,9,Example Bank,(123)467-5219,CT,Jefferson Court,6109,2018-04-18 16:51:47
8,NorthOlmsted,10,Example Bank,(123)414-5047,OH,Cambridge Road,44070,2018-04-18 16:51:47
9,Hillsborough,11,Example Bank,(123)436-6354,NJ,3rd Street West,8844,2018-04-18 16:51:47

In [57]:
branch_df_p.to_json('../data/credit_card_dataset_transformed/transformed_branch.json', orient='records', lines=True)

In [58]:
branch_df = session.createDataFrame(branch_df_p)

c:\Users\GzuzC\OneDrive\Documents\Notes\Personal Studies\Workbooks and Worksheets\Python\PerScholas Data Engineering\perscholas_capstone_project\ignore\ETL-capstone-env\lib\site-packages\pyspark\sql\pandas\conversion.py:474: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for column, series in pdf.iteritems():
c:\Users\GzuzC\OneDrive\Documents\Notes\Personal Studies\Workbooks and Worksheets\Python\PerScholas Data Engineering\perscholas_capstone_project\ignore\ETL-capstone-env\lib\site-packages\pyspark\sql\pandas\conversion.py:486: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for column, series in pdf.iteritems():

In [59]:
branch_df.show(2)

+-----------+-----------+------------+-------------+------------+-----------------+----------+-------------------+
|BRANCH_CITY|BRANCH_CODE| BRANCH_NAME| BRANCH_PHONE|BRANCH_STATE|    BRANCH_STREET|BRANCH_ZIP|       LAST_UPDATED|
+-----------+-----------+------------+-------------+------------+-----------------+----------+-------------------+
|  Lakeville|          1|Example Bank|(123)456-5276|          MN|     Bridle Court|     55044|2018-04-18 16:51:47|
|    Huntley|          2|Example Bank|(123)461-8993|          IL|Washington Street|     60142|2018-04-18 16:51:47|
+-----------+-----------+------------+-------------+------------+-----------------+----------+-------------------+
only showing top 2 rows

In [62]:
credit_df.show(2)

+-----------+----------------+---------+---+-----+--------------+----------------+-----------------+----+
|BRANCH_CODE|  CREDIT_CARD_NO| CUST_SSN|DAY|MONTH|TRANSACTION_ID|TRANSACTION_TYPE|TRANSACTION_VALUE|YEAR|
+-----------+----------------+---------+---+-----+--------------+----------------+-----------------+----+
|        114|4210653349028689|123459988| 14|    2|             1|       Education|             78.9|2018|
|         35|4210653349028689|123459988| 20|    3|             2|   Entertainment|            14.24|2018|
+-----------+----------------+---------+---+-----+--------------+----------------+-----------------+----+
only showing top 2 rows

In [64]:
credit_df.printSchema()

root
 |-- BRANCH_CODE: long (nullable = true)
 |-- CREDIT_CARD_NO: string (nullable = true)
 |-- CUST_SSN: long (nullable = true)
 |-- DAY: long (nullable = true)
 |-- MONTH: long (nullable = true)
 |-- TRANSACTION_ID: long (nullable = true)
 |-- TRANSACTION_TYPE: string (nullable = true)
 |-- TRANSACTION_VALUE: double (nullable = true)
 |-- YEAR: long (nullable = true)

In [106]:
credit_df.createOrReplaceTempView("credit_df")  # YYYYMMDD

In [67]:
credit_df_p = credit_df.toPandas()

In [89]:
credit_df_p.dtypes

BRANCH_CODE            int64
CREDIT_CARD_NO        object
CUST_SSN               int64
DAY                    int64
MONTH                 object
TRANSACTION_ID         int64
TRANSACTION_TYPE      object
TRANSACTION_VALUE    float64
YEAR                   int64
dtype: object

In [93]:
credit_df_p['MONTH'] = credit_df_p['MONTH'].apply(lambda x: str( "0" + str(x)) if len(str(x)) < 2 else str(x))

In [94]:
credit_df_p.head(2)

,BRANCH_CODE,CREDIT_CARD_NO,CUST_SSN,DAY,MONTH,TRANSACTION_ID,TRANSACTION_TYPE,TRANSACTION_VALUE,YEAR
0,114,4210653349028689,123459988,14,02,1,Education,78.90,2018
1,35,4210653349028689,123459988,20,03,2,Entertainment,14.24,2018

In [100]:
credit_df = session.createDataFrame(credit_df_p)

c:\Users\GzuzC\OneDrive\Documents\Notes\Personal Studies\Workbooks and Worksheets\Python\PerScholas Data Engineering\perscholas_capstone_project\ignore\ETL-capstone-env\lib\site-packages\pyspark\sql\pandas\conversion.py:474: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for column, series in pdf.iteritems():
c:\Users\GzuzC\OneDrive\Documents\Notes\Personal Studies\Workbooks and Worksheets\Python\PerScholas Data Engineering\perscholas_capstone_project\ignore\ETL-capstone-env\lib\site-packages\pyspark\sql\pandas\conversion.py:486: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for column, series in pdf.iteritems():

In [105]:
credit_df.show(2)

+-----------+----------------+---------+---+-----+--------------+----------------+-----------------+----+
|BRANCH_CODE|  CREDIT_CARD_NO| CUST_SSN|DAY|MONTH|TRANSACTION_ID|TRANSACTION_TYPE|TRANSACTION_VALUE|YEAR|
+-----------+----------------+---------+---+-----+--------------+----------------+-----------------+----+
|        114|4210653349028689|123459988| 14|   02|             1|       Education|             78.9|2018|
|         35|4210653349028689|123459988| 20|   03|             2|   Entertainment|            14.24|2018|
+-----------+----------------+---------+---+-----+--------------+----------------+-----------------+----+
only showing top 2 rows

In [107]:
credit_df.createOrReplaceTempView("credit_df")

In [108]:
credit_df_concat = session.sql("""
    SELECT 
        *, 
        CONCAT(CAST(YEAR AS STRING), 
        CAST(MONTH AS STRING), 
        CAST(DAY AS STRING)) AS TIMEID
    FROM 
        credit_df
""")

In [109]:
credit_df_concat.show(2)

+-----------+----------------+---------+---+-----+--------------+----------------+-----------------+----+--------+
|BRANCH_CODE|  CREDIT_CARD_NO| CUST_SSN|DAY|MONTH|TRANSACTION_ID|TRANSACTION_TYPE|TRANSACTION_VALUE|YEAR|  TIMEID|
+-----------+----------------+---------+---+-----+--------------+----------------+-----------------+----+--------+
|        114|4210653349028689|123459988| 14|   02|             1|       Education|             78.9|2018|20180214|
|         35|4210653349028689|123459988| 20|   03|             2|   Entertainment|            14.24|2018|20180320|
+-----------+----------------+---------+---+-----+--------------+----------------+-----------------+----+--------+
only showing top 2 rows

In [180]:
credit_df_concat.printSchema()

root
 |-- BRANCH_CODE: long (nullable = true)
 |-- CREDIT_CARD_NO: string (nullable = true)
 |-- CUST_SSN: long (nullable = true)
 |-- DAY: long (nullable = true)
 |-- MONTH: string (nullable = true)
 |-- TRANSACTION_ID: long (nullable = true)
 |-- TRANSACTION_TYPE: string (nullable = true)
 |-- TRANSACTION_VALUE: double (nullable = true)
 |-- YEAR: long (nullable = true)
 |-- TIMEID: string (nullable = true)

In [197]:
for names in ['YEAR', 'MONTH', 'DAY']:
    credit_df_concat = credit_df_concat.drop(names)

In [198]:
credit_df_concat.printSchema()

root
 |-- BRANCH_CODE: long (nullable = true)
 |-- CREDIT_CARD_NO: string (nullable = true)
 |-- CUST_SSN: long (nullable = true)
 |-- TRANSACTION_ID: long (nullable = true)
 |-- TRANSACTION_TYPE: string (nullable = true)
 |-- TRANSACTION_VALUE: double (nullable = true)
 |-- TIMEID: string (nullable = true)

In [199]:
credit_df_concat_backup = credit_df_concat.toPandas()

In [ ]:
credit_df_concat_backup.to_json('../data/credit_card_dataset_transformed/credit_transformed.json', orient='records', lines=True)